src/cf/DataProcessors/РасчетСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>РасчетСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцентПремии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/AccumulationRegisters/ПродажиПоАкциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоАкциям</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ПланПродаж</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПремииСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ПремииСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Премия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/РасчетСебестоимости/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасчитатьСебестоимость(Команда)
	Если ПериодРасчета = Дата(1, 1, 1) Тогда
		ПериодРасчета = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
		
	РасчитатьСебестоимостьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчитатьСебестоимостьНаСервере()
	РасчитатьСебестоимостьПоФифо();
	РасчитатьПремию();
КонецПроцедуры

&НаСервере
Процедура РасчитатьСебестоимостьПоФифо();
//TODO Сосновый А.С.
//Не плохо бы написать расчет
	
КонецПроцедуры


&НаСервере
Процедура РасчитатьПремию()
	
	ОчиститьСтарыЗаписиПоПремии();
	
	ЗапросПоПреми = Новый Запрос;
	ЗапросПоПреми.Текст = "ВЫБРАТЬ
	                |	СУММА(ПродажиПоАкциямОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	                |	ПродажиПоАкциямОбороты.Продавец
	                |ПОМЕСТИТЬ ВтПродажиСотрудника
	                |ИЗ
	                |	РегистрНакопления.ПродажиПоАкциям.Обороты(&НачалоМесяца, &КонецМесяца, Месяц, ) КАК ПродажиПоАкциямОбороты
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПродажиПоАкциямОбороты.Продавец
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПланПродажСрезПоследних.Сотрудник,
	                |	ПланПродажСрезПоследних.ПланПродаж
	                |ПОМЕСТИТЬ ВтПлан
	                |ИЗ
	                |	РегистрСведений.ПланПродаж.СрезПоследних(&КонецМесяца, ) КАК ПланПродажСрезПоследних
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВтПродажиСотрудника.Продавец,
	                |	ВтПродажиСотрудника.СтоимостьОборот
	                |ИЗ
	                |	ВтПродажиСотрудника КАК ВтПродажиСотрудника
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПлан КАК ВтПлан
	                |		ПО ВтПродажиСотрудника.Продавец = ВтПлан.Сотрудник
	                |			И ВтПродажиСотрудника.СтоимостьОборот >= ВтПлан.ПланПродаж";
	ЗапросПоПреми.УстановитьПараметр("НачалоМесяца",НачалоМесяца(ПериодРасчета));
	ЗапросПоПреми.УстановитьПараметр("КонецМесяца",КонецМесяца(ПериодРасчета));
	ВыборкаПОПеремии =  ЗапросПоПреми.Выполнить().Выбрать();
	
	Пока ВыборкаПОПеремии.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПремииСотрудников.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сотрудник = ВыборкаПОПеремии.Продавец;
		МенеджерЗаписи.Премия 	 = ВыборкаПОПеремии.СтоимостьОборот * Объект.ПроцентПремии/100;
		МенеджерЗаписи.Период 	 = КонецМесяца(ПериодРасчета);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;	
					
	
КонецПроцедуры	

&НаСервере
Процедура ОчиститьСтарыЗаписиПоПремии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПремииСотрудниковСрезПоследних.Сотрудник,
	               |	ПремииСотрудниковСрезПоследних.Премия,
	               |	ПремииСотрудниковСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.ПремииСотрудников.СрезПоследних(&ДатаРасчета, ) КАК ПремииСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("ДатаРасчета",КонецМесяца(ПериодРасчета));			   
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ПремииСотрудников.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник); 
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период); 
		НаборЗаписей.Записать();	
		
	КонецЦикла;	
		
КонецПроцедуры
